---
# applyTo: 'modules/converter/**'
name: 'Markdown_to_JSON_Converter'
description: 'Правила использования конвертора MD ↔ JSON для работы с базой данных'
---

# Модуль конвертации MD ↔ JSON

## Назначение

Модуль `modules/converter/` обеспечивает двунаправленную конвертацию между Markdown и JSON форматами для работы с игровой базой данных.

## Компоненты модуля

| Файл | Экспорт | Назначение |
|------|---------|------------|
| `__init__.py` | `convert_to_json`, `MarkdownToJsonConverter`, `DatabaseProcessor` | Публичный API модуля |
| `MarkdownToJsonConverter.py` | `convert_to_json`, `MarkdownToJsonConverter` | MD → JSON конвертация |
| `JsonToMarkdownConverter.py` | — | JSON → MD конвертация |
| `database_processor.py` | `DatabaseProcessor` | Пакетная обработка DataBase/ |
| `convert_archive_to_md.py` | — | Конвертация архивов сессий |

## Рабочий процесс MD → JSON

1. **Сбор данных**: Из игровых сессий/книг собираются данные по объектам
2. **Сохранение в .md**: Данные в читаемом виде сохраняются в `DataBase/`
3. **Конвертация**: Запускается конвертор для преобразования `.md` → `.json`
4. **Генерация ID**: JSON содержит уникальный ID (SHA256, 8 символов) на основе имени файла
5. **Использование**: Приложение читает JSON для контекста OpenAI

## Структура директорий для конвертации

```
DataBase/
├── GlobalItems/              # Общие объекты (ручное наполнение, MD → JSON)
│   ├── Armors/
│   ├── Equipments/
│   ├── Locations/
│   ├── NPC/
│   ├── Quests/
│   ├── Spells/
│   └── Weapons/
├── open5e_download/            # Загруженные из Open5e (только JSON, JSON → MD для редактирования)
│   ├── Creatures/
│   ├── Items/
│   └── Spells/
├── GameStoryBook/            # Сценарии игр
│   └── [Scenario]/
│       └── Items/           # Структура как в GlobalItems
├── AddonsStoryBook/          # Дополнения
│   └── [Addon]/
│       └── Items/           # Структура как в GlobalItems
└── Session/                  # Сессии
    └── [SessionName]/
        ├── archive_session.json  # Архив → MD через convert_archive_to_md.py
        └── Items/           # Структура как в GlobalItems
```

## Маркер конвертации

**Файл-маркер**: `toJson.md`

- Если в директории есть `toJson.md` — собрать все `.md` файлы для конвертации
- Если нет `toJson.md` — пропустить директорию

## Использование конвертора

### Базовый вызов

```python
from modules.converter.MarkdownToJsonConverter import convert_to_json

# Конвертация с разделением файла
results = convert_to_json(
    source_file="path/to/items.md",
    split_by_separator=True  # Разделить по ---
)
```

### Параметры

- `source_file` (str): Путь к исходному `.md` файлу
- `output_filename` (Optional[str]): Имя выходного файла (без расширения). По умолчанию берётся из заголовка
- `output_dir` (Optional[str]): Директория для сохранения. По умолчанию рядом с исходным файлом
- `split_by_separator` (bool): Разделять ли файл по `---` на несколько JSON файлов. **По умолчанию True для базы данных**

### Возвращаемое значение

`List[str]` — список путей к созданным JSON файлам

## Формат входных данных

### Структура .md файла

```markdown
# Название объекта
tags: тег1, тег2, тег3

## Характеристика1
Значение1

## Характеристика2
- Элемент списка 1
- Элемент списка 2

---

# Другой объект
tags: другие, теги

## Свойство
Значение
```

### Пример выходного JSON

```json
{
  "Название объекта": {
    "id": "a3f5c9e1",
    "tags": ["тег1", "тег2", "тег3"],
    "Характеристика1": "Значение1",
    "Характеристика2": ["Элемент списка 1", "Элемент списка 2"]
  }
}
```

## Интеграция в бот

### Запуск через /admin меню

1. Администратор открывает `/admin`
2. Выбирает "📁 Файлы и ресурсы"
3. Нажимает "🔄 Подготовить/Обновить базу данных JSON"
4. Бот сканирует директории с маркером `toJson.md`
5. Конвертирует все найденные `.md` файлы
6. Отправляет отчёт о результатах

### Логика сканирования

```python
# 1. Поиск директорий с маркером
directories_with_marker = []
for dir in database_dirs:
    if (dir / "toJson.md").exists():
        directories_with_marker.append(dir)

# 2. Сбор .md файлов (кроме маркера)
md_files = []
for dir in directories_with_marker:
    md_files.extend([
        f for f in dir.glob("*.md")
        if f.name != "toJson.md"
    ])

# 3. Конвертация каждого файла
for md_file in md_files:
    results = convert_to_json(
        source_file=str(md_file),
        split_by_separator=True
    )
```

## Важные правила

1. **Всегда используйте `split_by_separator=True`** для файлов базы данных
2. **Не удаляйте маркер `toJson.md`** после конвертации
3. **Один `.md` файл** может содержать множество объектов, разделённых `---`
4. **ID генерируется автоматически** на основе имени файла
5. **Теги** автоматически преобразуются в список: `tags: a, b, c` → `["a", "b", "c"]`
6. **Кодировка**: всегда UTF-8
7. **Заголовки**: поддерживаются до 10 уровней (`#` до `##########`)

## JSON → MD конвертация

Для редактирования загруженных данных из Open5e или обратной конвертации используйте `JsonToMarkdownConverter.py`.

## Архивы сессий

`convert_archive_to_md.py` конвертирует `archive_session.json` в читаемый Markdown формат.

## Документация модуля

| Файл | Описание |
|------|----------|
| `MODULE_README.md` | Общая документация модуля |
| `MARKDOWN_TO_JSON_QUICKSTART.md` | Быстрый старт MD→JSON |
| `MARKDOWN_TO_JSON_README.md` | Полная документация MD→JSON |
| `JSON_TO_MARKDOWN_QUICKSTART.md` | Быстрый старт JSON→MD |
| `JSON_TO_MARKDOWN_README.md` | Полная документация JSON→MD |
| `ARCHIVE_CONVERTER_README.md` | Документация архивов |

## Обработка ошибок

- `FileNotFoundError`: Исходный файл не найден
- `ValueError`: Неподдерживаемый формат файла (не .md и не .txt)
- Логирование всех операций через `modules.logger`

## Пример использования DatabaseProcessor

```python
from modules.converter import DatabaseProcessor
from pathlib import Path

processor = DatabaseProcessor(Path("DataBase"))
stats = processor.process_all()
print(f"Обработано: {stats['files_converted']} файлов, создано: {stats['json_created']} JSON")
```
